#include <stdio.h>

int main ()
{
    int x = 5, y = 10;                //объявим какие-нибудь переменные
    int *p1 = 0, *p2 = 0, **pp1 = 0;    //объявляем два указателя и один указатель на указатель
    
    p1 = &x;                        //присвоим указателю p1 адрес переменной x
    p2 = &y;                        //присвоим указателю p2 адрес переменной y
    
    printf ("Adress %X point to x = %d\n", p1, *p1);
    printf ("Adress %X point to y = %d\n", p2, *p2);
    
    
    /* Присвоим теперь указателю pp1 адрес указателя p1.
     * Это делается путем присвоения адреса p1 через оператор 
     * взятия адреса "&". Тут и появляется адрес указателя на указатель*/
    
    pp1 = &p1;                
    printf ("Adress %X point to adress %X point to x = %d\n", pp1, *pp1, **pp1);


    /* А теперь заменим адрес, на который указывает указатель pp1.
     * Это делается путем разыменования уровня, где хранится p1,
     * и присвоения этому уровню значения p2. Символ разыменования '*'. У нас уровень один,

     * а значит и звездочка перед pp1 одна.
     * Если до этого указателю pp1 не был присвоен адрес другого указателя,

     * то есть pp1 не был инициализирован (pp1 = &p1, как сделано выше),
     * то следующий код скомпилируется и соберется, но код будет работать
     * неверно, ведь у pp1 нет адреса (либо "мусор", если вначале программы не инициализировать pp1 нулем),

     * по которому должно храниться значение адреса p1 или p2. */ 
     
    *pp1 = p2;    //или *pp1 = &y - разницы никакой
    printf ("Adress %X point to adress %X point to y = %d\n", pp1, *pp1, **pp1);
    
    return 0;
}